## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "audit_log_dead_letter_queue_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "Detect when a message is sent to the Audit Log Dead Letter Queue"
      + alarm_name                            = "AuditLogDeadLetterQueueWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags                                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "QueueName" = "arn:aws:sqs:ca-central-1:687401027353:audit_log_deadletter_queue"
                }
              + metric_name = "ApproximateNumberOfMessagesVisible"
              + namespace   = "AWS/SQS"
              + period      = 60
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "m2"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "QueueName" = "arn:aws:sqs:ca-central-1:687401027353:audit_log_deadletter_queue"
                }
              + metric_name = "ApproximateNumberOfMessagesNotVisible"
              + namespace   = "AWS/SQS"
              + period      = 60
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "RATE(m2+m1)"
          + id          = "e1"
          + label       = "Error Rate"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.forms_dead_letter_queue_warn will be destroyed
  # (because aws_cloudwatch_metric_alarm.forms_dead_letter_queue_warn is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "forms_dead_letter_queue_warn" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - A message has been sent to the Dead Letter Queue." -> null
      - alarm_name                = "DeadLetterQueueWarn" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:DeadLetterQueueWarn" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 1 -> null
      - dimensions                = {
          - "QueueName" = "deadletter_queue.fifo"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "DeadLetterQueueWarn" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ApproximateNumberOfMessagesDelayed" -> null
      - namespace                 = "AWS/SQS" -> null
      - ok_actions                = [] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.reliability_dead_letter_queue_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "reliability_dead_letter_queue_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "Detect when a message is sent to the Reliability Dead Letter Queue"
      + alarm_name                            = "ReliabilityDeadLetterQueueWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags                                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "QueueName" = ""
                }
              + metric_name = "ApproximateNumberOfMessagesVisible"
              + namespace   = "AWS/SQS"
              + period      = 60
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "m2"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "QueueName" = ""
                }
              + metric_name = "ApproximateNumberOfMessagesNotVisible"
              + namespace   = "AWS/SQS"
              + period      = 60
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "RATE(m2+m1)"
          + id          = "e1"
          + label       = "Error Rate"
          + return_data = true
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
